app/controllers/admin_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = 1
SELECT COUNT(*) FROM "questions" WHERE "questions"."quiz_id" IS NULL
SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" IS NULL LIMIT 10 OFFSET 0
---
	def assignquestions
	   session[:quiz_id]=params[:quiz_id]
	   @quizquestions=Question.where(:quiz_id=> session[:quiz_id])
	   @generalquestions=Question.where(:quiz_id=>nil)
	   @generalquestions_count=@generalquestions.count
	   @generalquestions=@generalquestions.paginate(:page => params[:page], :per_page => 10)