app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
def index
@books = Book.all.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "books" ("author", "bookname", "booktype", "category", "created_at", "duedate", "lenddate", "price", "renewcount", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create
	@book=Book.new(params[:book])
	if @book.save