app/controllers/questions_controller.rb

	def index
	@questions=Question.all
---
SELECT "questions".* FROM "questions"

	def show
		@question=Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "15"]]