app/controllers/wiki_pages_controller.rb

  def index
  @wiki_pages=WikiPage.all.paginate(:page => params[:page], :per_page => 2)
---
SELECT "wiki_pages".* FROM "wiki_pages"

  def show
    @page = WikiPage.find(params[:id])
---
SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."id" = ? LIMIT 1  [["id", "23"]]

  def edit
    @page = WikiPage.find(params[:id])
---
SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."id" = ? LIMIT 1  [["id", "23"]]

  def update
    @page = WikiPage.find(params[:id])
    if @page.update_attributes(params[:wiki_page])
---
SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."id" = ? LIMIT 1  [["id", "24"]]
UPDATE "wiki_pages" SET "author" = 'teacher_1', "content" = '<p>dfsdfsdfsdfsdfd</p>