app/views/common/_chat.html.erb

 <table id ="chatTable">
<% User.where("id != ?",current_user.id).order("created_at DESC").each_with_index do |user, index| %>
---
SELECT "users".* FROM "users" WHERE (id != 1) ORDER BY created_at DESC