app/views/common/_conversation.html.erb

SELECT "conversations".* FROM "conversations" WHERE (conversations.sender_id =27 OR conversations.recipient_id =27) ORDER BY created_at DESC
---
 <div style="height: 300px; overflow-y: auto;">
      <% @conversations = Conversation.involving(current_user).order("created_at DESC")

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = 19 ORDER BY "messages"."id" DESC LIMIT 1
---
                    <%= link_to conversation_interlocutor(conversation).name, conversation_path(conversation), class: "conversation", "data-cid" => conversation.id %>
                        <p><%= conversation.messages.last.nil? ? "No messages" : truncate(conversation.messages.last.body, length: 45) %></p>